tests/load/jmeter.log
2026-08-08 10:00:07,811 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-08 10:00:07,832 INFO o.a.j.JMeter: Loading user properties from: /var/www/html/moodle45_aliseadele/mod/vimipad/tests/load/apache-jmeter-5.6.3/bin/user.properties
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Loading system properties from: /var/www/html/moodle45_aliseadele/mod/vimipad/tests/load/apache-jmeter-5.6.3/bin/system.properties
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: base_url=http://localhost/moodle45_aliseadele
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: token=da893088a3fc3be96ca94f47b44a94e2
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: workspaceid=20
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: cmid=701
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: revision=2000
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: threads=25
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: rampup=10
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: loops=20
2026-08-08 10:00:07,833 INFO o.a.j.JMeter: Setting JMeter property: maxduration=2000
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: Version 5.6.3
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: java.version=21.0.11
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: os.name=Linux
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: os.arch=amd64
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: os.version=6.18.33.2-microsoft-standard-WSL2
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-08 10:00:07,839 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-08 10:00:07,840 INFO o.a.j.JMeter: Available Processors =14
2026-08-08 10:00:07,850 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-08 10:00:07,850 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-08 10:00:07,850 INFO o.a.j.JMeter: JMeterHome=/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load/apache-jmeter-5.6.3
2026-08-08 10:00:07,850 INFO o.a.j.JMeter: user.dir  =/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load
2026-08-08 10:00:07,851 INFO o.a.j.JMeter: PWD       =/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load
2026-08-08 10:00:07,851 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: LAPTOP-M1G9QRV1 FullName: LAPTOP-M1G9QRV1.localdomain
2026-08-08 10:00:07,865 INFO o.a.j.s.FileServer: Default base='/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load'
2026-08-08 10:00:07,867 INFO o.a.j.s.FileServer: Set new base='/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load'
2026-08-08 10:00:08,034 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-08 10:00:08,057 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-08 10:00:08,060 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-08 10:00:08,063 INFO o.a.j.s.SaveService: Loading file: vimipad-read-endpoints.jmx
2026-08-08 10:00:08,107 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-08 10:00:08,107 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-08 10:00:08,107 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-08 10:00:08,107 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-08 10:00:08,108 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-08 10:00:08,108 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-08 10:00:08,138 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-08 10:00:08,150 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-08 10:00:08,151 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-08 10:00:08,151 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-08 10:00:08,155 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-08 10:00:08,155 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-08 10:00:08,210 INFO o.a.j.JMeter: Running test (1786176008210)
2026-08-08 10:00:08,233 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Readers
2026-08-08 10:00:08,234 INFO o.a.j.e.StandardJMeterEngine: Starting 25 threads for group Readers.
2026-08-08 10:00:08,234 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-08 10:00:08,234 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=25 ramp-up=10 delayedStart=false
2026-08-08 10:00:08,240 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-1
2026-08-08 10:00:08,257 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-08 10:00:08,257 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-08 10:00:08,262 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-M1G9QRV1
2026-08-08 10:00:08,267 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-08 10:00:08,269 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-08 10:00:08,269 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-08 10:00:08,269 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-08 10:00:08,269 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-08 10:00:08,637 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-2
2026-08-08 10:00:09,036 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-3
2026-08-08 10:00:09,435 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-4
2026-08-08 10:00:09,836 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-5
2026-08-08 10:00:10,237 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-6
2026-08-08 10:00:10,638 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-7
2026-08-08 10:00:11,035 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-8
2026-08-08 10:00:11,436 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-9
2026-08-08 10:00:11,837 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-10
2026-08-08 10:00:12,235 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-11
2026-08-08 10:00:12,245 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-1
2026-08-08 10:00:12,245 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-1
2026-08-08 10:00:12,635 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-12
2026-08-08 10:00:12,808 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-2
2026-08-08 10:00:12,809 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-2
2026-08-08 10:00:13,036 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-13
2026-08-08 10:00:13,436 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-14
2026-08-08 10:00:13,514 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-3
2026-08-08 10:00:13,514 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-3
2026-08-08 10:00:13,834 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-15
2026-08-08 10:00:14,097 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-4
2026-08-08 10:00:14,097 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-4
2026-08-08 10:00:14,235 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-16
2026-08-08 10:00:14,573 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-5
2026-08-08 10:00:14,573 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-5
2026-08-08 10:00:14,637 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-17
2026-08-08 10:00:15,036 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-18
2026-08-08 10:00:15,088 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-6
2026-08-08 10:00:15,089 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-6
2026-08-08 10:00:15,436 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-19
2026-08-08 10:00:15,676 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-7
2026-08-08 10:00:15,677 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-7
2026-08-08 10:00:15,836 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-20
2026-08-08 10:00:16,081 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-8
2026-08-08 10:00:16,081 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-8
2026-08-08 10:00:16,236 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-21
2026-08-08 10:00:16,621 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-9
2026-08-08 10:00:16,622 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-9
2026-08-08 10:00:16,636 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-22
2026-08-08 10:00:17,036 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-23
2026-08-08 10:00:17,054 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-10
2026-08-08 10:00:17,054 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-10
2026-08-08 10:00:17,435 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-24
2026-08-08 10:00:17,549 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-11
2026-08-08 10:00:17,549 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-11
2026-08-08 10:00:17,835 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-25
2026-08-08 10:00:17,971 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-12
2026-08-08 10:00:17,971 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-12
2026-08-08 10:00:18,373 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-13
2026-08-08 10:00:18,376 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-13
2026-08-08 10:00:19,085 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-14
2026-08-08 10:00:19,085 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-14
2026-08-08 10:00:19,218 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-15
2026-08-08 10:00:19,219 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-15
2026-08-08 10:00:19,826 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-16
2026-08-08 10:00:19,826 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-16
2026-08-08 10:00:20,282 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-17
2026-08-08 10:00:20,282 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-17
2026-08-08 10:00:20,462 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-18
2026-08-08 10:00:20,462 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-18
2026-08-08 10:00:20,847 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-19
2026-08-08 10:00:20,848 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-19
2026-08-08 10:00:21,141 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-20
2026-08-08 10:00:21,141 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-20
2026-08-08 10:00:21,450 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-21
2026-08-08 10:00:21,450 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-21
2026-08-08 10:00:21,693 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-22
2026-08-08 10:00:21,694 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-22
2026-08-08 10:00:21,976 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-23
2026-08-08 10:00:21,976 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-23
2026-08-08 10:00:22,140 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-24
2026-08-08 10:00:22,140 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-24
2026-08-08 10:00:22,343 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-25
2026-08-08 10:00:22,344 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-25
2026-08-08 10:00:22,344 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-08 10:00:22,345 INFO o.a.j.r.Summariser: summary =   2000 in 00:00:14 =  141.5/s Avg:    62 Min:    13 Max:   238 Err:     0 (0.00%)