tests/load/jmeter.log
2026-08-12 19:50:33,066 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-12 19:50:33,085 INFO o.a.j.JMeter: Loading user properties from: /var/www/html/moodle45_aliseadele/mod/vimipad/tests/load/apache-jmeter-5.6.3/bin/user.properties
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Loading system properties from: /var/www/html/moodle45_aliseadele/mod/vimipad/tests/load/apache-jmeter-5.6.3/bin/system.properties
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: base_url=http://localhost/moodle45_aliseadele
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: token=f3d6936e1ea0a7dcd8de661d574d2ce6
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: workspaceid=24
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: cmid=711
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: revision=5000
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: threads=25
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: rampup=10
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: loops=20
2026-08-12 19:50:33,086 INFO o.a.j.JMeter: Setting JMeter property: maxduration=2000
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: Version 5.6.3
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: java.version=21.0.11
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: os.name=Linux
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: os.arch=amd64
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: os.version=6.18.33.2-microsoft-standard-WSL2
2026-08-12 19:50:33,092 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-12 19:50:33,093 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-12 19:50:33,093 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-12 19:50:33,093 INFO o.a.j.JMeter: Available Processors =14
2026-08-12 19:50:33,100 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-12 19:50:33,101 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-12 19:50:33,101 INFO o.a.j.JMeter: JMeterHome=/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load/apache-jmeter-5.6.3
2026-08-12 19:50:33,101 INFO o.a.j.JMeter: user.dir  =/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load
2026-08-12 19:50:33,101 INFO o.a.j.JMeter: PWD       =/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load
2026-08-12 19:50:33,101 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: LAPTOP-M1G9QRV1 FullName: LAPTOP-M1G9QRV1.localdomain
2026-08-12 19:50:33,110 INFO o.a.j.s.FileServer: Default base='/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load'
2026-08-12 19:50:33,111 INFO o.a.j.s.FileServer: Set new base='/var/www/html/moodle45_aliseadele/mod/vimipad/tests/load'
2026-08-12 19:50:33,250 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-12 19:50:33,279 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-12 19:50:33,283 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-12 19:50:33,287 INFO o.a.j.s.SaveService: Loading file: vimipad-read-endpoints.jmx
2026-08-12 19:50:33,326 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 19:50:33,326 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 19:50:33,326 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 19:50:33,326 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 19:50:33,326 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-12 19:50:33,326 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-12 19:50:33,364 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-12 19:50:33,377 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-12 19:50:33,377 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-12 19:50:33,377 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-12 19:50:33,380 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-12 19:50:33,380 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-12 19:50:33,424 INFO o.a.j.JMeter: Running test (1786557033424)
2026-08-12 19:50:33,444 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Readers
2026-08-12 19:50:33,444 INFO o.a.j.e.StandardJMeterEngine: Starting 25 threads for group Readers.
2026-08-12 19:50:33,444 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-12 19:50:33,444 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=25 ramp-up=10 delayedStart=false
2026-08-12 19:50:33,450 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-1
2026-08-12 19:50:33,464 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-12 19:50:33,464 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-12 19:50:33,473 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-M1G9QRV1
2026-08-12 19:50:33,480 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-12 19:50:33,481 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-12 19:50:33,482 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-12 19:50:33,482 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-12 19:50:33,482 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-12 19:50:33,847 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-2
2026-08-12 19:50:33,849 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    2.4/s Avg:   307 Min:   307 Max:   307 Err:     0 (0.00%) Active: 2 Started: 2 Finished: 0
2026-08-12 19:50:34,247 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-3
2026-08-12 19:50:34,645 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-4
2026-08-12 19:50:35,045 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-5
2026-08-12 19:50:35,445 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-6
2026-08-12 19:50:35,845 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-7
2026-08-12 19:50:36,246 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-8
2026-08-12 19:50:36,647 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-9
2026-08-12 19:50:37,045 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-10
2026-08-12 19:50:37,446 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-11
2026-08-12 19:50:37,846 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-12
2026-08-12 19:50:38,247 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-13
2026-08-12 19:50:38,645 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-14
2026-08-12 19:50:39,046 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-15
2026-08-12 19:50:39,445 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-16
2026-08-12 19:50:39,846 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-17
2026-08-12 19:50:40,246 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-18
2026-08-12 19:50:40,647 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-19
2026-08-12 19:50:41,045 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-20
2026-08-12 19:50:41,447 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-21
2026-08-12 19:50:41,846 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-22
2026-08-12 19:50:42,245 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-23
2026-08-12 19:50:42,646 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-24
2026-08-12 19:50:43,045 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-25
2026-08-12 19:51:00,013 INFO o.a.j.r.Summariser: summary +   4576 in 00:00:26 =  174.9/s Avg:   113 Min:    14 Max:   708 Err:     0 (0.00%) Active: 25 Started: 25 Finished: 0
2026-08-12 19:51:00,014 INFO o.a.j.r.Summariser: summary =   4577 in 00:00:27 =  172.1/s Avg:   114 Min:    14 Max:   708 Err:     0 (0.00%)
2026-08-12 19:51:30,002 INFO o.a.j.r.Summariser: summary +   5287 in 00:00:30 =  176.3/s Avg:   141 Min:    18 Max:   769 Err:     0 (0.00%) Active: 25 Started: 25 Finished: 0
2026-08-12 19:51:30,003 INFO o.a.j.r.Summariser: summary =   9864 in 00:00:57 =  174.3/s Avg:   128 Min:    14 Max:   769 Err:     0 (0.00%)
2026-08-12 19:52:00,041 INFO o.a.j.r.Summariser: summary +   5450 in 00:00:30 =  181.4/s Avg:   134 Min:    19 Max:   633 Err:     0 (0.00%) Active: 25 Started: 25 Finished: 0
2026-08-12 19:52:00,041 INFO o.a.j.r.Summariser: summary =  15314 in 00:01:27 =  176.8/s Avg:   130 Min:    14 Max:   769 Err:     0 (0.00%)
2026-08-12 19:52:03,453 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-9
2026-08-12 19:52:03,454 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-9
2026-08-12 19:52:03,465 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-25
2026-08-12 19:52:03,466 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-25
2026-08-12 19:52:03,466 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-4
2026-08-12 19:52:03,467 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-4
2026-08-12 19:52:03,473 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-20
2026-08-12 19:52:03,473 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-20
2026-08-12 19:52:03,482 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-19
2026-08-12 19:52:03,482 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-19
2026-08-12 19:52:03,483 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-12
2026-08-12 19:52:03,483 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-12
2026-08-12 19:52:03,483 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-6
2026-08-12 19:52:03,483 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-6
2026-08-12 19:52:03,484 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-3
2026-08-12 19:52:03,484 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-3
2026-08-12 19:52:03,493 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-1
2026-08-12 19:52:03,493 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-15
2026-08-12 19:52:03,493 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-15
2026-08-12 19:52:03,493 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-1
2026-08-12 19:52:03,494 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-11
2026-08-12 19:52:03,494 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-11
2026-08-12 19:52:03,498 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-14
2026-08-12 19:52:03,498 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-14
2026-08-12 19:52:03,500 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-10
2026-08-12 19:52:03,500 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-10
2026-08-12 19:52:03,506 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-5
2026-08-12 19:52:03,506 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-5
2026-08-12 19:52:03,507 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-21
2026-08-12 19:52:03,507 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-21
2026-08-12 19:52:03,509 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-2
2026-08-12 19:52:03,510 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-2
2026-08-12 19:52:03,514 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-23
2026-08-12 19:52:03,515 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-23
2026-08-12 19:52:03,520 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-8
2026-08-12 19:52:03,521 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-8
2026-08-12 19:52:03,531 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-18
2026-08-12 19:52:03,531 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-18
2026-08-12 19:52:03,532 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-13
2026-08-12 19:52:03,532 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-13
2026-08-12 19:52:03,533 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-7
2026-08-12 19:52:03,533 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-7
2026-08-12 19:52:03,541 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-24
2026-08-12 19:52:03,541 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-24
2026-08-12 19:52:03,542 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-16
2026-08-12 19:52:03,542 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-16
2026-08-12 19:52:03,565 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-17
2026-08-12 19:52:03,565 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-17
2026-08-12 19:52:03,584 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Readers 1-22
2026-08-12 19:52:03,584 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-22
2026-08-12 19:52:03,584 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-12 19:52:03,585 INFO o.a.j.r.Summariser: summary +    628 in 00:00:04 =  177.2/s Avg:   141 Min:    21 Max:   615 Err:     0 (0.00%) Active: 0 Started: 25 Finished: 25
2026-08-12 19:52:03,586 INFO o.a.j.r.Summariser: summary =  15942 in 00:01:30 =  176.8/s Avg:   131 Min:    14 Max:   769 Err:     0 (0.00%)